app/controllers/colors_controller.rb

SELECT "colors".* FROM "colors"
---
    def index
        colors = Color.all

SELECT "colors".* FROM "colors" WHERE "colors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        color = Color.find_by(id: params[:id])

INSERT INTO "colors" ("rgb", "created_at", "updated_at") VALUES (?, ?, ?)  [["rgb", "rgb(164, 164, 112)"], ["created_at", "2020-05-29 04:39:01.793530"], ["updated_at", "2020-05-29 04:39:01.793530"]]
---
    def create
        color = Color.create!(rgb: params[:rgb])