app/controllers/images_controller.rb

    def index
        images = Image.all
---
SELECT "images".* FROM "images"

    def show
        image = Image.find_by(id: params[:id])
---
SELECT "images".* FROM "images" WHERE "images"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def destroy
        image = Image.find_by(id: params[:id])
        image.delete
---
SELECT "images".* FROM "images" WHERE "images"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "images" WHERE "images"."id" = ?  [["id", 1]]