app/controllers/swatches_controller.rb

SELECT "swatches".* FROM "swatches"
---
    def index
        swatches = Swatch.all

SELECT "swatches".* FROM "swatches" WHERE "swatches"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        swatch = Swatch.find_by(id: params[:id])